# Lab | Data Cleaning and Formatting

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

In [1]:
link = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv'

In [2]:
import pandas as pd

In [3]:
df_OG = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv")
df_OG.head(5)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [4]:
df = df_OG.copy()

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

*Hint*:
- *Column names should be in lower case*
- *White spaces in column names should be replaced by `_`*
- *`st` could be replaced for `state`*

In [5]:
# Your code here
df.columns = df.columns.str.lower().str.replace(" ", "_") #column name in lowercase & replace space by _
df.rename(columns= {'st': 'state'}, inplace=True) #change column name inplace
df.head(0)

Empty DataFrame
Columns: [customer, state, gender, education, customer_lifetime_value, income, monthly_premium_auto, number_of_open_complaints, policy_type, vehicle_class, total_claim_amount]
Index: []

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they only contain valid data.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

*Hint*:
- *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".*
- *State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*
- *In education, "Bachelors" could be replaced by "Bachelor"*
- *In Customer Lifetime Value, delete the `%` character*
- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

In [6]:
df.shape

(4008, 11)

In [7]:
#harmonising state
df.state=df.state.replace("WA", "Washington") #we are replacing WA for Washington to harmonise result
df.state=df.state.replace("AZ", "Arizona")
df.state=df.state.replace("Cali", "California")
df["state"].value_counts()

state
California    331
Oregon        320
Arizona       211
Washington    111
Nevada         98
Name: count, dtype: int64

In [8]:
#harmonising gender
df['gender']=df['gender'].replace("Male", "M")
df['gender']=df['gender'].replace("female", "F")
df['gender']=df['gender'].replace("Femal", "F")
df['gender'].value_counts()

gender
F    502
M    452
Name: count, dtype: int64

In [9]:
#harmonising education
df['education']=df['education'].replace("Bachelors", "Bachelor")
df['education'].value_counts()

education
Bachelor                331
College                 313
High School or Below    296
Master                   94
Doctor                   37
Name: count, dtype: int64

In [10]:
#Remove %
df['customer_lifetime_value'] = df['customer_lifetime_value'].str.replace('%','')
df['customer_lifetime_value']

0              NaN
1        697953.59
2       1288743.17
3        764586.18
4        536307.65
           ...
4003           NaN
4004           NaN
4005           NaN
4006           NaN
4007           NaN
Name: customer_lifetime_value, Length: 4008, dtype: object

In [11]:
#harmonising vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" for "Luxury"
df['vehicle_class'] = df['vehicle_class'].str.replace('Sports Car', 'Luxury')
df['vehicle_class'] = df['vehicle_class'].str.replace('Luxury SUV', 'Luxury')
df['vehicle_class'] = df['vehicle_class'].str.replace('Luxury Car', 'Luxury')
df['vehicle_class'].value_counts()

vehicle_class
Four-Door Car    576
Two-Door Car     205
SUV              199
Luxury            91
Name: count, dtype: int64

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

*Hint*:
- *Customer lifetime value should be numeric*
- *Number of open complaints has an incorrect format. Look at the different values it takes with `unique()` and take the middle value. As an example, 1/5/00 should be 5. Number of open complaints is a string - remember you can use `split()` to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.*

In [12]:
# Your code here
df.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value       object
income                       float64
monthly_premium_auto         float64
number_of_open_complaints     object
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [ ]:
# The column customer_lifetime_value has NaNs, those cannot be changed to an integer
# First we HAVE TO drop the NaNs from that column and then we change the type

In [13]:
df["customer_lifetime_value"].notna().sum()

1068

In [14]:
df['customer_lifetime_value'].isna().sum() # Check NaN

2940

In [15]:
df['customer_lifetime_value'] = df['customer_lifetime_value'].astype(float)

In [76]:
#don't understand thiss
# df['customer_lifetime_value'] = df['customer_lifetime_value'].astype(float).round(0).astype(int)

/var/folders/d9/b5sfz3_12tv_8rtt32lkmw8h0000gn/T/ipykernel_5975/1872232165.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['customer_lifetime_value'] = df['customer_lifetime_value'].astype(float).round(0).astype(int)

In [ ]:
#  NUMBER_OF_COMPLAINTS

In [16]:
df['number_of_open_complaints'] = df['number_of_open_complaints'].str.split('/').str[1]

In [17]:
df['number_of_open_complaints'].isna().sum()

2937

In [18]:
df['number_of_open_complaints'] = df['number_of_open_complaints'].astype(float)

In [19]:
df.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value      float64
income                       float64
monthly_premium_auto         float64
number_of_open_complaints    float64
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the `isnull()` function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables, and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (note: we haven't covered this yet)

Implement your chosen strategy to handle the null values. You can use the `fillna()` function in pandas to fill null values or `dropna()` function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the `isnull()` function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers.

In [20]:
rows = df.shape[0]

In [21]:
# Checking the % of null values we have per column
round((df.isnull().sum())/rows*100,2)

customer                     73.28
state                        73.28
gender                       76.20
education                    73.28
customer_lifetime_value      73.35
income                       73.28
monthly_premium_auto         73.28
number_of_open_complaints    73.28
policy_type                  73.28
vehicle_class                73.28
total_claim_amount           73.28
dtype: float64

In [22]:
# Checking how many null values we have per column
df.isnull().sum()

customer                     2937
state                        2937
gender                       3054
education                    2937
customer_lifetime_value      2940
income                       2937
monthly_premium_auto         2937
number_of_open_complaints    2937
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64

In [23]:
round(df.describe(),2)

,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount
count,1068.00,1071.00,1071.00,1071.00,1071.00
mean,793690.26,39295.70,193.23,0.39,404.99
std,643478.41,30469.43,1601.19,0.88,293.03
min,200435.07,0.00,61.00,0.00,0.38
25%,403408.00,14072.00,68.00,0.00,202.16
50%,588174.24,36234.00,83.00,0.00,354.73
75%,896287.20,64631.00,109.50,0.00,532.80
max,5816655.35,99960.00,35354.00,5.00,2893.24

In [24]:
# fill null values with the mean

# CUSTOMER_LIFETIME_VALUE
mean_cltv = round(df.customer_lifetime_value.mean(),2) #create variable for mean
df["customer_lifetime_value"] = df["customer_lifetime_value"].fillna(mean_cltv) # fillna()

# INCOME
mean_income = round(df.income.mean(),2) #create variable for mean
df["income"] = df["income"].fillna(mean_income) # fillna()

# MONTHLY PREMIUM AUTO
mean_mpa = round(df.monthly_premium_auto.mean(),2)
df['monthly_premium_auto'] = df['monthly_premium_auto'].fillna(mean_mpa)

# TOTAL CLAIM
mean_claim = round(df.total_claim_amount.mean(),2)
df['total_claim_amount'] = df['total_claim_amount'].fillna(mean_claim)

In [28]:
# DROPPED COLUMNS
df = df.drop("customer", axis=1) #remove 'customer' column
df = df.drop("gender", axis=1) #remove 'gender' column
df = df.drop("number_of_open_complaints", axis=1) #remove 'number_of_open_complaints' column
df = df.drop("vehicle_class", axis=1) #remove 'vehicle_class' column

In [53]:
df.isnull().sum()

state                      2937
education                  2937
customer_lifetime_value       0
income                        0
monthly_premium_auto          0
policy_type                2937
total_claim_amount            0
dtype: int64

In [35]:
df.policy_type.value_counts()

policy_type
Personal Auto     780
Corporate Auto    234
Special Auto       57
Name: count, dtype: int64

In [42]:
# df2=df.copy()
# df2 ["policy_type"] = df2 ["policy_type"].fillna(method="bfill")
### no sense because newarly all the NaNs become Personal Auto --> not well distirbuted

In [43]:
# df2 ["policy_type"].value_counts()

In [83]:
df.gender.value_counts()

gender
F    502
M    452
Name: count, dtype: int64

In [30]:
df.head(9)

,state,education,customer_lifetime_value,income,monthly_premium_auto,policy_type,total_claim_amount
0,Washington,Master,793690.26,0.0,1000.0,Personal Auto,2.704934
1,Arizona,Bachelor,697953.59,0.0,94.0,Personal Auto,1131.464935
2,Nevada,Bachelor,1288743.17,48767.0,108.0,Personal Auto,566.472247
3,California,Bachelor,764586.18,0.0,106.0,Corporate Auto,529.881344
4,Washington,High School or Below,536307.65,36357.0,68.0,Personal Auto,17.269323
5,Oregon,Bachelor,825629.78,62902.0,69.0,Personal Auto,159.383042
6,Oregon,College,538089.86,55350.0,67.0,Corporate Auto,321.600000
7,Arizona,Master,721610.03,0.0,101.0,Corporate Auto,363.029680
8,Oregon,Bachelor,2412750.40,14072.0,71.0,Corporate Auto,511.200000

## Exercise 5: Dealing with duplicates

Use the `.duplicated()` method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the `drop_duplicates()` function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using `.duplicated()`.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

*Hint*: *after dropping duplicates, reset the index to ensure consistency*.

In [34]:
# Your code here
df.duplicated().sum()

2945

# Bonus: Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting.

Write these functions in separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [ ]:
# Your code here

# Bonus: Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In the Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we had tried to work with that column, we wouldn't have been able to because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, let's get some more interesting insights!

Instructions:

- Review the statistics again for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the `.describe()` method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [ ]:
# Your code here